{"text" : "Read all instructions before using the microwave oven. Read and follow the specific “PRECAUTIONS TO AVOID POSSIBLE EXPOSURE TO EXCESSIVE MICROWAVE ENERGY” found in this section. The microwave oven must be grounded. Connect only to properly grounded outlet. Install or locate the microwave oven only in accordance with the provided Installation Instructions.Use the microwave oven only for its intended use as described in this manual. Do not use corrosive chemicals or vapors in the microwave oven. Oversized foods or oversized metal utensils should not be inserted in the microwave oven as they may create a fire or risk of electric shock.Do not clean with metal scouring pads. Do not store any materials, other than manufacturers recommended accessories, in this oven when not in use. Do not operate the microwave oven if it has a damaged cord or plug, if it is not working properly, or if it has been damaged or dropped. Do not deep fry in oven. Do not use paper products when appliance is operated in the “PAN BROWN” mode. Do not cover racks or any other part of the oven with metal foil. To reduce the risk of injury to persons: – Do not overheat the liquid. – Stir the liquid both before and halfway through heating it. Do not use straight-sided containers with narrow necks.After heating, allow the container to stand in the microwave oven for a short time before removing the container. –Use extreme care when inserting a spoon or other utensil into the container. Do not store the microwave oven outdoors.Do not use this product near water To reduce the risk of fire in the oven cavity: – Do not overcook food. Carefully attend the microwave oven if paper, plastic, or other combustible materials are placed inside the oven to facilitate cooking. Remove wire twist-ties from paper or plastic bags before placing bags in oven. If materials inside the oven should ignite, keep oven door closed, turn oven off, and disconnect the power cord, or shut off power at the fuse or circuit breaker panel. Do not use the cavity for storage purposes. Do not leave paper products, cooking utensils, or food in the cavity when not in useTo avoid damage to the microwave oven, do not lean on or allow children to swing on the microwave oven door. To avoid damage to the microwave oven, do not operate microwave oven when it is empty. Baby bottles and baby food jars should not be heated in microwave oven. Clothes, flowers, fruit, herbs, wood, gourds, paper, including brown paper bags and newspaper, should not be dried in microwave oven. Use oven mitts or potholders when removing containers from microwave oven. Do not cook or reheat whole eggs inside the shell. Aluminum Foil, Metal See “Aluminum Foil and Metal” section. Browning Dish Bottom must be at least 3/16 (5 mm) above the turntable. Follow manufacturers recommendations.Ceramic Glass, Glass Acceptable for use China, Earthenware Follow manufacturers recommendations. Melamine Follow manufacturers recommendations. Paper: Towels, Dinnerware, Napkins Use non-recycled and those approved by the manufacturer for microwave oven use. Plastic: Wraps, Bags, Covers, Dinnerware, Containers Use those approved by the manufacturer for microwave oven use. Pottery and Clay Follow manufacturers recommendations. Silicone Bakeware Follow manufacturers recommendations. Straw, Wicker, Wooden Containers Do not use in microwave oven. Wax Paper Acceptable for useTo Test Cookware or Dinnerware for Microwave Use: 1. Place cookware or dinnerware in microwave oven with 1 cup (250 mL) of water beside it. 2. Cook at 100% cooking power for 1 minute. Do not use cookware or dinnerware if it becomes hot and the water stays cool.Always use oven mitts or pot holders when removing dishes from the microwave oven.If not used properly, arcing (a blue flash of light) can occur and cause damage to the microwave oven.To restart cooking, close the door, and touch START UPPER.If you do not want to continue cooking, close the door and the light goes off, or touch CANCEL UPPER.If the microwave oven door is opened during a sensor function, the microwave oven will turn off and any additional operations will be canceled.Before using a Sensor Cook function, make sure power has been supplied to the microwave oven for at least 2 minutes, the room temperature is not above 95°F (35°C), and the outside of the cooking container and the microwave oven cavity are dry. Many sensor cycles require covering foods. When covering foods with plastic wrap, be sure to leave a large enough vent opening to allow steam to escape.Unwrap foods and remove lids (from fruit juice) before defrosting. Remove any metal twist-ties, and replace them with strings or elastic bands. If food is foil wrapped, remove foil and place it in a suitable container. Slit the skins, if any, of frozen food such as sausage. Bend plastic pouches of food to ensure even defrosting. Always underestimate defrosting time. If defrosted food is still icy in the center, return it to the microwave oven for more defrosting. The length of defrosting time varies according to how solidly the food is frozen.  Shallow packages will defrost more quickly than deep blocks. Separate food pieces as soon as possible during or at the end of a cycle for more even defrosting. Foods left outside the freezer for more than 20 minutes or frozen ready-made food should not be defrosted using the Custom Defrost feature but should be defrosted manually. Use small pieces of aluminum foil to shield parts of food, such as chicken wings, leg tips, and fish tails. ","rules" : [{"text" : "Read all instructions before using the microwave oven", "condition" : "", "consequence" : "Read all instructions before using the microwave oven","action" : ""}, {"text" : "Read and follow the specific “PRECAUTIONS TO AVOID POSSIBLE EXPOSURE TO EXCESSIVE MICROWAVE ENERGY” found in this section", "condition" : "", "consequence" : "Read and follow the specific “PRECAUTIONS TO AVOID POSSIBLE EXPOSURE TO EXCESSIVE MICROWAVE ENERGY” found in this section","action" : ""}, {"text" : "The microwave oven must be grounded", "condition" : "", "consequence" : "The microwave oven must be grounded","action" : ""}, {"text" : "Connect only to properly grounded outlet", "condition" : "", "consequence" : "Connect only to properly grounded outlet","action" : ""}, {"text" : "Install or locate the microwave oven only in accordance with the provided Installation Instructions", "condition" : "", "consequence" : "Install or locate the microwave oven only in accordance with the provided Installation Instructions","action" : ""}, {"text" : "Use the microwave oven only for its intended use as described in this manual", "condition" : "", "consequence" : "Use the microwave oven only for its intended use as described in this manual","action" : ""}, {"text" : "Do not use corrosive chemicals or vapors in the microwave oven", "condition" : "", "consequence" : "Do not use corrosive chemicals or vapors in the microwave oven","action" : ""}, {"text" : "Oversized foods or oversized metal utensils should not be inserted in the microwave oven as they may create a fire or risk of electric shock", "condition" : "Oversized foods or oversized metal utensils", "consequence" : "create a fire or risk of electric shock","action" : ""}, {"text" : "Do not clean with metal scouring pads", "condition" : "", "consequence" : "Do not clean with metal scouring pads","action" : ""}, {"text" : "Do not store any materials, other than manufacturers recommended accessories, in this oven when not in use", "condition" : "not in use", "consequence" : "Do not store any materials, other than manufacturers recommended accessories","action" : ""}, {"text" : "Do not operate the microwave oven if it has a damaged cord or plug, if it is not working properly, or if it has been damaged or dropped", "condition" : "if it has a damaged cord or plugif it is not working properlyif it has been damaged or dropped", "consequence" : "Do not operate the microwave oven","action" : ""}, {"text" : "Do not deep fry in oven", "condition" : "", "consequence" : "Do not deep fry in oven","action" : ""}, {"text" : "Do not use paper products when appliance is operated in the “PAN BROWN” mode", "condition" : "when appliance is operated in the “PAN BROWN” mode", "consequence" : "Do not use paper products","action" : ""}, {"text" : "Do not cover racks or any other part of the oven with metal foil", "condition" : "", "consequence" : "Do not cover racks or any other part of the oven with metal foil","action" : ""}, {"text" : "To reduce the risk of injury to persons: – Do not overheat the liquid. – Stir the liquid both before and halfway through heating it", "condition" : "reduce the risk of injury to persons", "consequence" : "Do not overheat the liquidStir the liquid both before and halfway through heating it","action" : ""}, {"text" : "Do not use straight-sided containers with narrow necks", "condition" : "", "consequence" : "Do not use straight-sided containers with narrow necks","action" : ""}, {"text" : "After heating, allow the container to stand in the microwave oven for a short time before removing the container", "condition" : "After heating", "consequence" : "allow the container to stand in the microwave oven for a short time before removing the container","action" : ""}, {"text" : "Use extreme care when inserting a spoon or other utensil into the container", "condition" : "inserting a spoon or other utensil into the container", "consequence" : "Use extreme care","action" : ""}, {"text" : "Do not store the microwave oven outdoors", "condition" : "", "consequence" : "Do not store the microwave oven outdoors","action" : ""}, {"text" : "Do not use this product near water", "condition" : "", "consequence" : "Do not use this product near water","action" : ""}, {"text" : "To reduce the risk of fire in the oven cavity: – Do not overcook food", "condition" : "Do not overcook food", "consequence" : "reduce the risk of fire in the oven cavity","action" : ""}, {"text" : "Carefully attend the microwave oven if paper, plastic, or other combustible materials are placed inside the oven to facilitate cooking. ", "condition" : "if paper, plastic, or other combustible materials are placed inside the oven", "consequence" : "Carefully attend the microwave","action" : ""}, {"text" : "Remove wire twist-ties from paper or plastic bags before placing bags in oven", "condition" : "", "consequence" : "Remove wire twist-ties from paper or plastic bags before placing bags in oven","action" : ""}, {"text" : "If materials inside the oven should ignite, keep oven door closed, turn oven off, and disconnect the power cord, or shut off power at the fuse or circuit breaker panel", "condition" : "If materials inside the oven should ignite", "consequence" : "keep oven door closed, turn oven off, and disconnect the power cord, or shut off power at the fuse or circuit breaker panel","action" : ""}, {"text" : "Do not use the cavity for storage purposes", "condition" : "", "consequence" : "Do not use the cavity for storage purposes","action" : ""}, {"text" : "Do not leave paper products, cooking utensils, or food in the cavity when not in use", "condition" : "not in use", "consequence" : "Do not leave paper products, cooking utensils, or food in the cavity","action" : ""}, {"text" : "To avoid damage to the microwave oven, do not lean on or allow children to swing on the microwave oven door", "condition" : "To avoid damage to the microwave oven", "consequence" : "do not lean on or allow children to swing on the microwave oven door","action" : ""}, {"text" : "To avoid damage to the microwave oven, do not operate microwave oven when it is empty", "condition" : "To avoid damage to the microwave oven", "consequence" : "do not operate microwave oven when it is empty","action" : ""}, {"text" : "Baby bottles and baby food jars should not be heated in microwave oven", "condition" : "", "consequence" : "Baby bottles and baby food jars should not be heated in microwave oven","action" : ""}, {"text" : "Clothes, flowers, fruit, herbs, wood, gourds, paper, including brown paper bags and newspaper, should not be dried in microwave oven", "condition" : "", "consequence" : "Clothes, flowers, fruit, herbs, wood, gourds, paper, including brown paper bags and newspaper, should not be dried in microwave oven","action" : ""}, {"text" : "Use oven mitts or potholders when removing containers from microwave oven", "condition" : "when removing containers from microwave oven", "consequence" : "Use oven mitts or potholders","action" : ""}, {"text" : "Do not cook or reheat whole eggs inside the shell", "condition" : "", "consequence" : "Do not cook or reheat whole eggs inside the shell","action" : ""}, {"text" : "Aluminum Foil, Metal See “Aluminum Foil and Metal” section. ", "condition" : "Aluminum FoilMetal", "consequence" : "See “Aluminum Foil and Metal” section","action" : ""}, {"text" : "Ceramic Glass, Glass Acceptable for use China, Earthenware Follow manufacturers recommendations. ", "condition" : "Ceramic Glass, Glass", "consequence" : "Acceptable for use China, Earthenware Follow manufacturers recommendations","action" : ""}, {"text" : "Melamine Follow manufacturers recommendations. ", "condition" : "Melamine", "consequence" : "Follow manufacturers recommendations","action" : ""}, {"text" : "Paper: Towels, Dinnerware, Napkins Use non-recycled and those approved by the manufacturer for microwave oven use. ", "condition" : "Paper: Towels, Dinnerware, Napkins", "consequence" : "Use non-recycled and those approved by the manufacturer for microwave oven use","action" : ""}, {"text" : "Plastic: Wraps, Bags, Covers, Dinnerware, Containers Use those approved by the manufacturer for microwave oven use. ", "condition" : "Plastic: Wraps, Bags, Covers, Dinnerware, Containers", "consequence" : "Use those approved by the manufacturer for microwave oven use. ","action" : ""}, {"text" : "Pottery and Clay Follow manufacturers recommendations. ", "condition" : "Pottery and Clay", "consequence" : "Follow manufacturers recommendations","action" : ""}, {"text" : "Silicone Bakeware Follow manufacturers recommendations. ", "condition" : "Silicone Bakeware", "consequence" : "Follow manufacturers recommendations","action" : ""}, {"text" : "Straw, Wicker, Wooden Containers Do not use in microwave oven. ", "condition" : "Straw, Wicker, Wooden Containers", "consequence" : "Do not use in microwave oven","action" : ""}, {"text" : "Wax Paper Acceptable for use", "condition" : "Wax Paper", "consequence" : "Acceptable for use","action" : ""}, {"text" : "To Test Cookware or Dinnerware for Microwave Use: 1. Place cookware or dinnerware in microwave oven with 1 cup (250 mL) of water beside it. 2. Cook at 100% cooking power for 1 minute", "condition" : "To Test Cookware or Dinnerware for Microwave", "consequence" : "Use: 1. Place cookware or dinnerware in microwave oven with 1 cup (250 mL) of water beside it2. Cook at 100% cooking power for 1 minute","action" : ""}, {"text" : "Do not use cookware or dinnerware if it becomes hot and the water stays cool", "condition" : "it becomes hot and the water stays cool", "consequence" : "Do not use cookware or dinnerware","action" : ""}, {"text" : "Always use oven mitts or pot holders when removing dishes from the microwave oven", "condition" : "removing dishes from the microwave oven", "consequence" : "Always use oven mitts or pot holders","action" : ""}, {"text" : "If not used properly, arcing (a blue flash of light) can occur and cause damage to the microwave oven", "condition" : "If not used properly", "consequence" : "arcing (a blue flash of light) can occur and cause damage to the microwave oven","action" : ""}, {"text" : "To restart cooking, close the door, and touch START UPPER", "condition" : "To restart cooking", "consequence" : "close the door, and touch START UPPER","action" : ""}, {"text" : "If you do not want to continue cooking, close the door and the light goes off, or touch CANCEL UPPER", "condition" : "If you do not want to continue cooking", "consequence" : "close the door and the light goes off, or touch CANCEL UPPER","action" : ""}, {"text" : "If the microwave oven door is opened during a sensor function, the microwave oven will turn off and any additional operations will be canceled", "condition" : "If the microwave oven door is opened during a sensor function", "consequence" : "the microwave oven will turn off and any additional operations will be canceled","action" : ""}, {"text" : "Before using a Sensor Cook function, make sure power has been supplied to the microwave oven for at least 2 minutes, the room temperature is not above 95°F (35°C), and the outside of the cooking container and the microwave oven cavity are dry. Many sensor cycles require covering foods. When covering foods with plastic wrap, be sure to leave a large enough vent opening to allow steam to escape", "condition" : "Before using a Sensor Cook functioncovering foods with plastic wrap", "consequence" : "make sure power has been supplied to the microwave oven for at least 2 minutes, the room temperature is not above 95°F (35°C), and the outside of the cooking container and the microwave oven cavity are drybe sure to leave a large enough vent opening to allow steam to escape","action" : ""}, {"text" : "Unwrap foods and remove lids (from fruit juice) before defrosting", "condition" : "defrosting", "consequence" : "Unwrap foods and remove lids (from fruit juice) before","action" : ""}, {"text" : "Remove any metal twist-ties, and replace them with strings or elastic bands", "condition" : "", "consequence" : "Remove any metal twist-ties, and replace them with strings or elastic bands","action" : ""}, {"text" : "If food is foil wrapped, remove foil and place it in a suitable container", "condition" : "If food is foil wrapped", "consequence" : "remove foil and place it in a suitable container","action" : ""}, {"text" : "Slit the skins, if any, of frozen food such as sausage", "condition" : "if any, of frozen food such as sausage", "consequence" : "Slit the skins","action" : ""}, {"text" : "Bend plastic pouches of food to ensure even defrosting", "condition" : "", "consequence" : "Bend plastic pouches of food to ensure even defrosting","action" : ""}, {"text" : "Always underestimate defrosting time", "condition" : "", "consequence" : "Always underestimate defrosting time","action" : ""}, {"text" : "If defrosted food is still icy in the center, return it to the microwave oven for more defrosting", "condition" : "If defrosted food is still icy in the center", "consequence" : "return it to the microwave oven for more defrosting","action" : ""}, {"text" : "Foods left outside the freezer for more than 20 minutes or frozen ready-made food should not be defrosted using the Custom Defrost feature but should be defrosted manually", "condition" : "not be defrosted using the Custom Defrost featureshould be defrosted manually", "consequence" : "Foods left outside the freezer for more than 20 minutes or frozen ready-made food","action" : ""}, {"text" : "Use small pieces of aluminum foil to shield parts of food, such as chicken wings, leg tips, and fish tails. ", "condition" : "Use small pieces of aluminum foil to shield parts of food", "consequence" : "chicken wings, leg tips, and fish tails","action" : ""}]}