{"text" : "'LifewireTECH FOR HUMANSBEST PRODUCTSNEWSWINDOWSSTREAMINGSMART HOMEHOW-TOABOUT USEmail AddressNEWSLETTER!Search CloseSearch the siteSearch here...GONEWSBEST PRODUCTSMOBILE PHONESCOMPUTERSSMART LIFESTREAMINGGAMINGSOCIAL MEDIASOFTWARE & APPSHOME THEATERNETWORKING & SECURITYEMAIL & MESSAGINGGet tech\"s top stories in 30 seconds:Email Addressenter emailSign upAbout UsContact UsEditorial GuidelinesPrivacy PolicySOFTWARE & APPS > WINDOWSHow to Troubleshoot Beep CodesIs your computer beeping? Here/'s what to doBy Tim Fisher  Updated on October 19, 2021   Reviewed by Ryan PerianTweetShareEmailWINDOWSThe Ultimate Laptop Buying GuideWhat to KnowPower on or restart the computer and listen carefully to the beeps.Write down the number of beeps and whether they are long, short, or of equal length. Also, make a note if the beeps repeat.Install a tool to determine the BIOS maker and then consult the appropriate online troubleshooting guide.This article explains how to figure out why your PC is beeping by noting the beep pattern, determining your computer/'s BIOS maker, and consulting the matching online guide.How to Troubleshoot Beep CodesIf you/'re hearing beep codes after you turn your computer on—and then it doesn/'t start—it means the motherboard encountered some kind of problem before it was able to send any error information to the monitor.Follow these steps below to determine what computer problem the beep code is representing. Once you know what/'s wrong, you can work to fix the problem.Power on the computer or restart it if it/'s already on.Listen very carefully to the beep codes that sound when the computer begins to boot.Restart your computer if you need to hear the beeping again. You/'re probably not going to make whatever problem you have worse by restarting a few times.Write down, in whatever way makes sense to you, how the beeps sound.Pay close attention to the number of beeps, if the beeps are long or short (or all the same length), and if the beeping repeats or not. There is a big difference between a \"beep-beep-beep\" and a \"beep-beep.\"Yes, this might all seem a little crazy, but this is important information that will help determine what issue the beep codes are representing. If you get this wrong, you/'ll be trying to solve a problem your computer doesn/'t have and ignoring the real one.Next, you/'ll need to figure out what company manufactured the BIOS chip that/'s on your computer motherboard. Unfortunately, the computer industry never agreed on a uniform way to communicate with beeps, so it/'s important to get this right.The easiest way to figure this is out is by installing one of a free system information tool, which should tell you if your BIOS is made by AMI, Award, Phoenix, or another company. If that doesn/'t work, you could open your computer and take a peek at the actual BIOS chip on your computer motherboard, which should have the company name printed on or next to it.Your computer maker isn/'t the same as the BIOS maker and your motherboard maker isn/'t necessarily the same as the BIOS maker, so don/'t assume you already know the right answer to this question.Now that you know the BIOS manufacturer, choose the troubleshooting guide below based on that information:AMI Beep Code Troubleshooting (AMIBIOS)Award Beep Code Troubleshooting (AwardBIOS)Phoenix Beep Code Troubleshooting (PhoenixBIOS)Using the beep code information specific to those BIOS makers in those articles, you/'ll be able to figure out exactly what/'s wrong that/'s causing the beeping, be it a RAM issue, a video card problem, or some other hardware problem.More Help With Beep CodesSome computers, even though they may have BIOS firmware made by a particular company, like AMI or Award, further customize their beep-to-problem language, making this process a little frustrating. If you think this might be the case, or just worried it could be, almost every computer maker publishes their beep code list in their user guides, which you can probably find online.If you need help digging up your computer/'s manual, go online to find tech support information.Beep beep on windowJohn Mulligan / Getty ImagesWas this page helpful?More from LifewireClose up of computer motherboardWhat Are AwardBIOS Beep Codes and What Do They Mean?Illustration of a person reading \"Interpreting AMIBIOS Beep Codes\" while their computer beeps at themWhat are AMIBIOS Beep Codes and What Do They Mean?POST screen example showing a BIOS version numberIs Your Computer Making Beeping Noises? Here/'s What That/'s All AboutPicture of a black monitor in front of a blue backgroundHow to Fix a Computer That Turns on but Displays NothingClose-Up Of Computer Mother BoardCan/'t Access BIOS? This Could Be What You NeedPOST screen example showing a BIOS version numberWhat Is a POST Error Message?Number columns on a computer screenEverything You Need to Know About the PC POST ProcessA20 Error illustrationTroubleshooting Guide for A20 ErrorsAn illustration of a computer that won/'t turn on.How to Fix a Computer That Won/'t Turn OnPerson tearing their hair out because of a Windows \"blue screen of death\"How to Fix a Blue Screen of Death (BSOD)POST test cardWhat Is a POST Code? (Power on Self Test Code)Hal.dll Error MessageHow to Fix Errors Seen During the Computer Startup ProcessMotherboard with CMOS batteryCMOS Checksum Error: What It Is and How to Fix ItHands using computer to config system vector illustration.Setting personal computer conceptWhat Does It Mean to /'Boot/' a Computer?A frustrated man views a PS4 disc ejecting error on his TV.How to Fix a PS4 That Keeps Ejecting Discs or BeepingBIOS chipHow to Update BIOSLifewireTech for HumansFollow UsSubscribe to our newsletter and get tech\"s top stories in 30 seconds.Email Addressenter emailSUBMITNewsBest ProductsMobile PhonesComputersAbout UsAdvertisePrivacy PolicyCookie PolicyCareersEditorial GuidelinesContactTerms of UseEU PrivacyCalifornia Privacy NoticeTRUSTeLifewire is part of the Dotdash Meredith publishing family.'","rules" : [{"text" : "'Also, make a note if the beeps repeat'", "condition" : "'if the beeps repeat'", "consequence" : "'make a note'","action" : "''"}, {"text" : "\"If you're hearing beep codes after you turn your computer on—and then it doesn't start—it means the motherboard encountered some kind of problem before it was able to send any error information to the monitor.\"", "condition" : "\"If you're hearing beep codes after you turn your computer on—and then it doesn't start\"", "consequence" : "'it means the motherboard encountered some kind of problem before it was able to send any error information to the monitor'","action" : "''"}, {"text" : "\"Power on the computer or restart it if it's already on\"", "condition" : "\"if it's already on\"", "consequence" : "'Power on the computer or restart it'","action" : "''"}, {"text" : "'Restart your computer if you need to hear the beeping again'", "condition" : "'if you need to hear the beeping again'", "consequence" : "'Restart your computer'","action" : "''"}, {"text" : "'Pay close attention to the number of beeps, if the beeps are long or short (or all the same length), and if the beeping repeats or not'", "condition" : "'if the beeps are long or short (or all the same length),and if the beeping repeats or not'", "consequence" : "'Pay close attention to the number of beeps'","action" : "''"}, {"text" : "\"If you get this wrong, you'll be trying to solve a problem your computer doesn't have and ignoring the real one\"", "condition" : "'If you get this wrong'", "consequence" : "\"you'll be trying to solve a problem your computer doesn't have and ignoring the real one\"","action" : "''"}, {"text" : "'The easiest way to figure this is out is by installing one of a free system information tool, which should tell you if your BIOS is made by AMI, Award, Phoenix, or another company'", "condition" : "'if your BIOS is made by AMI, Award, Phoenix, or another company'", "consequence" : "'installing one of a free system information'","action" : "''"}, {"text" : "\"If that doesn't work, you could open your computer and take a peek at the actual BIOS chip on your computer motherboard, which should have the company name printed on or next to it.\"", "condition" : "\"If that doesn't work\"", "consequence" : "'you could open your computer and take a peek at the actual BIOS chip on your computer motherboard, which should have the company name printed on or next to it'","action" : "''"}, {"text" : "'If you think this might be the case, or just worried it could be, almost every computer maker publishes their beep code list in their user guides, which you can probably find online'", "condition" : "'If you think this might be the case, or just worried it could be'", "consequence" : "'almost every computer maker publishes their beep code list in their user guides, which you can probably find online'","action" : "''"}, {"text" : "\"If you need help digging up your computer's manual, go online to find tech support information.\"", "condition" : "\"If you need help digging up your computer's manual\"", "consequence" : "'go online to find tech support information'","action" : "''"}]}