{"text" : "The Users Guide is divided into three sections: Stata basics, Elements of Stata, and Advice. The table of contents lists the chapters within each of these sections. Click on the chapter titles to see the detailed contents of each chapter. The Guide is full of a lot of useful information about Stata; we recommend that you read it. If you only have time, however, to read one or two chapters, then read [U] 11 Language syntax and [U] 12 Data. The other manuals are the Reference manuals. The Stata Reference manuals are each arranged like an encyclopedia—alphabetically. Look at the Base Reference Manual. Look under the name of a command. If you do not find the command, look in the subject index in [I] Stata Index. A few commands are so closely related that they are documented together, such as ranksum and median, which are both documented in [R] ranksum. Not all the entries in the Base Reference Manual are Stata commands; some contain technical information, such as [R] Maximize, which details Statas iterative maximization process, or [R] Error messages, which provides information on error messages and return codes. Like an encyclopedia, the Reference manuals are not designed to be read from cover to cover. When you want to know what a command does, complete with all the details, qualifications, and pitfalls, or when a command produces an unexpected result, read its description. Each entry is written at the level of the command. The descriptions assume that you have little knowledge of Statas features when they are explaining simple commands, such as those for using and saving data. For more complicated commands, they assume that you have a firm grasp of Statas other features. If a Stata command is not in the Base Reference Manual, you can find it in one of the other Reference manuals. The titles of the manuals indicate the types of commands that they contain. The Programming Reference Manual, however, contains commands not only for programming Stata but also for manipulating matrices (not to be confused with the matrix programming language described in the Mata Reference Manual).Every copy of Stata comes with Statas complete PDF documentation. The PDF documentation may be accessed from within Stata by selecting Help > PDF documentation. Even more convenient, every help file in Stata links to the equivalent manual entry. If you are reading help regress, simply click on (View complete PDF manual entry) below the title of the help file to go directly to the [R] regress manual entry. We provide some tips for viewing Statas PDF documentation at https://www.stata.com/support/ faqs/resources/pdf-documentation-tips/.If you look, for example, at the entry [R] brier, you will see a brief biographical vignette of Glenn Wilson Brier (1913–1998), who did pioneering work on the measures described in that entry. A few such vignettes were added without fanfare in the Stata 8 manuals, just for interest, and many more were added in Stata 9, and even more have been added in each subsequent release. A vignette could often appropriately go in several entries. For example, George E. P. Box deserves to be mentioned in entries other than [TS] arima, such as [R] boxcox. However, to save space, each vignette is given once only, and an index of all vignettes is given in the Stata Index. Most of the vignettes were written by Nicholas J. Cox, Durham University, and were compiled using a wide range of reference books, articles in the literature, Internet sources, and information from individuals. Especially useful were the dictionaries of Upton and Cook (2014) and Everitt and Skrondal (2010) and the compilations of statistical biographies edited by Heyde and Seneta (2001) and Johnson and Kotz (1997). Of these, only the first provides information on people living at the time of publication.We will occasionally lapse into periods of inordinate cuteness and write, “We described the data and then listed the data.” You get the idea. describe and list are Stata commands. We purposely began the previous sentence with a lowercase letter. Because describe is a Stata command, it must be typed in lowercase letters. The ordinary rules of capitalization are temporarily suspended in favor of preciseness. We also mix in words printed in italic type, such as “To perform the rank-sum test, type ranksum varname, by(groupvar)”. Italicized words are not supposed to be typed; instead, you are to substitute another word for them. We would also like users to note our rule for punctuation of quotes. We follow a rule that is often used in mathematics books and British literature. The punctuation mark at the end of the quote is included in the quote only if it is a part of the quote. For instance, the pleased Stata user said she thought that Stata was a “very powerful program”. Another user simply said, “I love Stata.” In this manual, however, there is little dialogue, and we follow this rule to precisely clarify what you are to type, as in, type “cd c:”. The period is outside the quotation mark because you should not type the period. If we had wanted you to type the period, we would have included two periods at the end of the sentence: one inside the quotation and one outside, as in, type “the orthogonal polynomial operator, p.”. We have tried not to violate the other rules of English. If you find such violations, they were unintentional and resulted from our own ignorance or carelessness. We would appreciate hearing about them. We have heard from Nicholas J. Cox of the Department of Geography at Durham University, UK, and express our appreciation. His efforts have gone far beyond dropping us a note, and there is no way with words that we can fully express our gratitude.","rules" : [{"text" : "Click on the chapter titles to see the detailed contents of each chapter", "condition" : "Click on the chapter titles", "consequence" : "to see the detailed contents of each chapter","action" : ""}, {"text" : "If you only have time, however, to read one or two chapters, then read [U] 11 Language syntax and [U] 12 Data", "condition" : "If you only have time, however, to read one or two chapters", "consequence" : "then read [U] 11 Language syntax and [U] 12 Data","action" : ""}, {"text" : "If you do not find the command, look in the subject index in [I] Stata Index", "condition" : "If you do not find the command", "consequence" : "look in the subject index in [I] Stata Index","action" : ""}, {"text" : "When you want to know what a command does, complete with all the details, qualifications, and pitfalls", "condition" : "When you want to know what a command does", "consequence" : "complete with all the details, qualifications, and pitfalls","action" : ""}, {"text" : "when a command produces an unexpected result, read its description", "condition" : "when a command produces an unexpected result", "consequence" : "read its description","action" : ""}, {"text" : "If a Stata command is not in the Base Reference Manual, you can find it in one of the other Reference manuals", "condition" : "If a Stata command is not in the Base Reference Manual", "consequence" : "you can find it in one of the other Reference manuals","action" : ""}, {"text" : "If you are reading help regress, simply click on (View complete PDF manual entry) below the title of the help file to go directly to the [R] regress manual entry", "condition" : "If you are reading help regress", "consequence" : "simply click on (View complete PDF manual entry) below the title of the help file to go directly to the [R] regress manual entry","action" : ""}, {"text" : "If we had wanted you to type the period, we would have included two periods at the end of the sentence", "condition" : "If we had wanted you to type the period", "consequence" : "we would have included two periods at the end of the sentence","action" : ""}]}