{"text" : "'Soccer has 17 laws or “rules” by which the game is played. Most of these laws areeasy to understand. The laws are \"designed to make soccer fun, safe, and fair for allparticipants.The object of soccer is for a player to get the ball into the other team\"s goal by usingany part of the body except the player\"s hands and arms. The goalie is the onlyplayer allowed to touch the ball with the hands and arms and then only while he islocated in his own penalty area.A referee is in charge of the soccer game. A referee\"s main objective should be thesafety of the players. It is the referee\"s responsibility to ensure that the gameremains fun for everyone. This includes players, spectators and the officials.You will undoubtedly question some of the officiating calls as you watch a soccergame. This is only natural. To be fair to the referee you should read and understand the 17 laws so that you have a good understanding of the rules of soccer. Try tokeep in mind that everyone who is watching a game has a different perspective.Spectators will be most likely, rooting for one team or the other. This will influence how they view the game. The spectators will more than likely have a family memberplaying in youth soccer. Also keep in mind that everyone will be viewing the gamefrom a different angle. Try to give the referee the benefit of a doubt. The refereesare much closer to the play than spectators. They should be trained in the laws andimpartial to the game\"s outcome.The 17 laws described below are the basic laws of soccer accepted throughout theworld. These laws are usually altered slightly so the game is more fun and beneficialfor young players. Each league should have a specific set of rules it will follow. Theserules should be distributed to the coach. Look over the rules of your league to makesure you fully understand them.LAW 1 - The Field of PlayThis is the basic layout of a soccer field. The size of the field will vary from league toleague, usually depending on the age of the players.LAW 2 - The BallA regulation size soccer ball is a No. 5 ball. Youth leagues may use different sizeballs, such as a No. 3 ball or a No. 4 ball, depending on the age of the children.LAW 3 - Number of PlayersThere must be no more than 11 players on the field of play for either team. Aminimum number of players is usually 7. Some youth leagues encourage games withless than 11 players to help in the development of young players. One player fromeach team must be designated as a goalkeeper. The goalkeeper must wear adifferent color shirt from his teammates so that everyone can easily distinguish thegoalie. The goalie can only use his hands inside the penalty area.LAW 4 - Player\"s EquipmentPlayers must wear the same colored jersey or shirts. All youth programs require shinguards to be worn by all players. If your players will be wearing cleats, make sure they are soccer cleats. A soccer cleat does not have a cleat at the front edge of theshoe like a baseball cleat. This is for safety.LAW 5 - RefereesThe referee enforces the 17 laws. There is one difference between soccer and mostother sports played in America. In soccer, the referee may let play continue and not call a foul if he or she thinks that stopping play would give an advantage to the team committing the foul. This is called the “advantage clause”. The referee should say“play on” when this occurs.LAW 6 - Linesmen and LineswomenTwo linesmen may assist the referee in controlling the game. The linesmen\"s duty isto signal to the referee when the ball is out; to indicate a corner kick, a goal kick orto designate which team is entitled to the throw-in. The linesmen may also signaloffsides, fouls or misconduct if a goal has been scored or when substitution isdesired.The referee on the field makes the official and final decisions. The linesmen are thereto assist the referee; the referee may or may not act upon their advice.Coaches should not expect to have linesmen at their youth soccer games.Sometimes you are lucky to have a single referee. I have coached games where theopposing coach and I had to take turns being the referee, because an official nevershowed up.LAW 7 - Duration of the GameThe duration of the game will depend on the age of the children. Older children willmore than likely have two halves. Younger children often times play four quarters.Your league will determine whether quarters or halves are played and how long eachwill be.LAW 8 - Start of Play: Kick Off and Drop BallA kick off is taken to start a game, to restart play after a goal has been scored or tostart the second half or a new quarter. At kickoff all players must be on their team\"s half of the field. The ball is placed on the center spot in the middle of the centercircle. The ball must be kicked forward at least one full rotation into the opponents\"“half of the field.” The team that kicks off to begin the game is determined by a cointoss between the captains and the referee. After a goal the team that was just scored upon starts the fkick off. For new quarters and halves, the team, which did notkick off the previous quarter or half will kick off. A goal cannot be scored by kickingthe ball directly into the goal on a kick off.A drop ball is played when the referee stops play for a reason other than a rule infraction. An injury is a good example. The referee restarts play by dropping the ballbetween two players, one from each team. A dropped ball may not be played until ittouches the ground. The first player playing the ball is allowed to play the ball againwithout it having to be touched by another player. This means the player maydribble, pass or shoot the ball after touching it.LAW 9 - Ball In and Out of PlayThe ball is out of play whenever it is completely outside the outside edge of thetouchline or the goal line either on the ground or in the air. Also it is out of playwhen the referee stops play for any reason.The ball is in play if any part of the ball is inside or touching the touchline or goalline. The ball is considered in play after bouncing off of a goal post, cross bar, cornerflag, linesmen or referee if the ball remains on the playing field.LAW 10 - Method of ScoringA goal can only be scored if the entire ball goes completely over the outside edge of the goal line, under the cross bar and between the goal posts while it is in play. Anyplayer may score goals, including the goalie. Except when taking a free kick, throw-in, goal kick, penalty kick or kick off, a ball played by a player directly into his owngoal is a score for the opposing team.LAW 11 - OffsideAn offensive player must have two opponents including the goalkeeper betweenhimself and the goal line at the moment the ball is passed to him. Offside isdetermined when the ball is passed to the player, not when the player receives theball.Offside position and offside are not the same. It is not against the rules to be in anoffside position. It is against the rules to be offside. Here is a definition of these twoconcepts.Offside Position - A player is in the offside position if he is:• ahead of the ball and• in the opponents half of the field and• there are fewer than two opponents even with or ahead of him.Offside -A player who is in the offside position becomes offside when• he participates in the play or• he interferes with an opponent or• otherwise tries to take advantage of being in the offside position.Exceptions - A player in an offside position is not to be called offside if he receivesthe ball directly from:• a throw-in or• a corner kick or• a goal kick.'","rules" : [{"text" : "'To be fair to the referee you should read and understand the 17 laws '", "condition" : "'To be fair to the referee'", "consequence" : "'you should read and understand the 17 laws'","action" : "''"}, {"text" : "'Spectators will be most likely, rooting for one team or the other. This will influence how they view the game'", "condition" : "'This will influence how they view the game'", "consequence" : "'Spectators will be most likely, rooting for one team or the other.'","action" : "''"}, {"text" : "'If your players will be wearing cleats, make sure they are soccer cleats'", "condition" : "'If your players will be wearing cleats'", "consequence" : "', make sure they are soccer cleats'","action" : "''"}, {"text" : "'In soccer, the referee may let play continue and not call a foul if he or she thinks that stopping play would give an advantage to the team committing the foul'", "condition" : "'. In soccer, the referee may let play continue and not call a foul'", "consequence" : "'he or she thinks that stopping play would give an advantage to the team committing the foul'","action" : "''"}, {"text" : "'At kickoff all players must be on their team\"s half of the field'", "condition" : "'At kickoff'", "consequence" : "' all players must be on their team\"s half of the field'","action" : "''"}, {"text" : "'After a goal the team that was just scored upon starts the fkick off'", "condition" : "'After a goal'", "consequence" : "'the team that was just scored upon starts the fkick off'","action" : "''"}, {"text" : "'A drop ball is played when the referee stops play for a reason other than a rule infraction'", "condition" : "'when the referee stops play for a reason other than a rule infraction'", "consequence" : "'A drop ball is played'","action" : "''"}, {"text" : "'A goal can only be scored if the entire ball goes completely over the outside edge of the goal line, under the cross bar and between the goal posts while it is in play'", "condition" : "'A goal can only be scored'", "consequence" : "'if the entire ball goes completely over the outside edge of the goal line, under the cross bar and between the goal posts while it is in play'","action" : "''"}]}