{"text" : "Consecutives are the no.1 bad guy in figured bass! You mustNEVERwrite consecutives.Consecutive 5ths often sneak in when there are tworoot position(5-3) chords next to each other.In the first chord, the tenor and bass parts are aperfect 5thapart. In the second chord, they are also a perfect fifth apart.When there are perfect 5ths in thesame two partsone after the other, we call them “consecutive 5ths”.We need to find another way to write one of the chords, to get rid of the consecutives.Now the perfect 5th in the second chord is between the alto and tenor parts – the 5ths are no longer consecutive, because they are indifferent parts.You have to check for consecutive 5ths between each voice of the harmony. This meanssixchecks between each chord:Sometimes the consecutives are more difficult to see: here are consecutive 5ths between the alto and bass parts.Arecompound5ths (i.e. an octave and a 5th) wrong ? YES, they are also illegal.Are diminished 5ths wrong? No, but you should still avoid writing them if possible.Does it count if the same notes are repeated? No, consecutives are only bad when the voices move.This is allowed, because the parts dont change notes.Consecutive octaves are just as bad as consecutive 5ths. Consecutive octaves can sneak in just about anywhere, so always be on the look out for them!Check for consecutive octaves between all six voice pairings,as above.Here are some illegal consecutive octaves:Consecutive 5ths and octaves are considered to be bad because it sounds as though the music has been reduced to only three parts. Each of the four voice parts should have a strong, independent identity, and this effect is dramatically lessened by consecutives.Also known as “concealed” or “exposed” consecutives, these are a little harder to spot, but must be avoided.Hidden consecutives happen when:The bass and soprano parts form aperfect 5thoroctaveANDThe 5th/8ve is approached bysimilar motionANDThe soprano part is approached by aleap(not by step).The bass and soprano parts form aperfect 5th.The 5th is approached bysimilar motion(both parts move upwards in the same direction, instead of one part going up and other part down (“contrary motion”) or staying the same (“oblique motion”).The soprano part contains aleap(the interval between the two notes is wider than a 2nd).We can fix a hidden consecutive by just fixingone problemfrom above.We can change around the notes, so that the 5th (or octave) disappears.We can change the similar motion to oblique (or contrary) motion:Or, we could make the soprano part move by step, instead of a leap.“Voice leading” is about how each note connects to the next one, in one voice part.In all voices:Leaps of a seventh are NOT allowed.In major keys, diminished/augmented melodic intervals are NOT recommended.Augmented 2nds and 4ths are NOT allowed.6ths should be avoided.Leading notes in dominant chords ALWAYS resolve onto the tonic of a tonic chord. (Bach didnt always do this, though!)In acadential 6-4, the 4 resolves to 3 and the 6 resolves to 5.Always choose a semitone step if one is available.In the soprano part, you should try to write a reasonably tuneful melody, but you should avoid leaps of more than a perfect 5th. Follow these guidelines:The best intervals to use are 2nds and 3rds.4ths and 5ths are OK, but should only be used in an emergency.Repeated notes can be used, but the more you use the more boring your melody will be, so only use them if you are stuck.As you can see, a good soprano line is made up mostly of intervals of a 2nd.In the alto and tenor parts, you are padding out the chords:Always choose thenearest notethat you can, without breaking any other rules (e.g. of consecutives or illegal intervals etc.)If possible, repeat the previous note.Otherwise, choose the next nearest note.Leaps of 4ths and 5ths are ok, but use them sparingly.Sometimes you dont have much choice about which note to write next. Here are some cases.Leading notes ALWAYS resolve onto the tonic when possible.In acadential 6-4, the 4 resolves to 3 and the 6 resolves to 5.Always choose a semitone step if one is available.The bass line should be reasonably melodic, without too much repetition of adjacent notes.The bass usually moves either by step, or by leaps of perfect 4ths and 5ths, or by leaps of 3rds. Octave leaps may be used in moderation.The bass should not leap by a 7th, an augmented or a diminished interval.The final note in the bass line of a piece must always be the tonic.All four-note chords need to double one note from the triad. But which one? Generally the 3rd is the least satisfactory note to double, but there are some exceptions.Use this table for reference while youre practicing. The greyed out chords are not used in tonal harmony at grade 6.The chord notes in brackets are OK but try not to use them unless you absolutely have to!Are you thinking –“Ill never remember all this?”Dont worry – its a normal reaction! Heres a Rule of Thumb which is easy to remember:Root position – 1 or 5First Inversion – anything goesSecond inversion – 5Watch out for:diminished chords (ii° and vii°) – ONLY double the thirdchord VI in minor keys CAN double the thirdVb – CANT double the third.3b. OmissionSometimes its ok to leave out thefifthof the triad.Never leave out a note that isfigured. So, if you see “5-3”, youmustinclude the third and the fifth. But if the chord is blank, it means you can leave out the fifth.If you see “6-3”, you must include the fifth (its the “3” of the 6-3), but if you see just “6”, then you can leave out the fifth.You can never leave out the fifth of a 6-4 chord.Never leave out the third or the root.4a. OverlapDont let your voice parts overlap. The soprano line must always be higher than all the rest, the alto must always be higher than the tenor. Be careful not to write parts which cross over like these two:In the first example, the alto part C is lower than the tenor E.In the second example, the tenor C is higher than the alto B in the next chord.Its ok to let the bass and tenor partssharea note from time to time.4b.RangeWhen you write for four voices (soprano, alto, tenor and bass), you should keep to the normal range that those voices can sing:These ranges are not absolutely fixed, but stay within them to stay safe!Never have an interval wider than an octave between the tenor and alto, or alto and soprano parts. Its ok to have more than an octave between the tenor and bass parts.","rules" : [{"text" : "Consecutive 5ths often sneak in when there are tworoot position(5-3) chords next to each other", "condition" : "when there are tworoot position(5-3) chords next to each other", "consequence" : "Consecutive 5ths often sneak in","action" : ""}, {"text" : "When there are perfect 5ths in thesame two partsone after the other, we call them “consecutive 5ths”", "condition" : "When there are perfect 5ths in thesame two partsone after the other", "consequence" : "we call them “consecutive 5ths”","action" : ""}, {"text" : "We need to find another way to write one of the chords, to get rid of the consecutives", "condition" : "to get rid of the consecutives", "consequence" : "We need to find another way to write one of the chords","action" : ""}, {"text" : "No, consecutives are only bad when the voices move", "condition" : "when the voices move", "consequence" : "consecutives are only bad","action" : ""}, {"text" : "This is allowed, because the parts dont change notes", "condition" : "because the parts dont change notes", "consequence" : "This is allowed","action" : ""}, {"text" : "Consecutive 5ths and octaves are considered to be bad because it sounds as though the music has been reduced to only three parts", "condition" : "it sounds as though the music has been reduced to only three parts", "consequence" : "Consecutive 5ths and octaves are considered to be bad","action" : ""}, {"text" : "Always choose a semitone step if one is available", "condition" : "if one is available", "consequence" : "Always choose a semitone step","action" : ""}, {"text" : "If possible, repeat the previous note", "condition" : "If possible", "consequence" : "repeat the previous note","action" : ""}, {"text" : "Otherwise, choose the next nearest note", "condition" : "Otherwise", "consequence" : "choose the next nearest note","action" : ""}, {"text" : "Leading notes ALWAYS resolve onto the tonic when possible", "condition" : "when possible", "consequence" : "Leading notes ALWAYS resolve onto the tonic","action" : ""}, {"text" : "In acadential 6-4, the 4 resolves to 3 and the 6 resolves to 5", "condition" : "In acadential 6-4", "consequence" : "the 4 resolves to 3 and the 6 resolves to 5","action" : ""}, {"text" : "Always choose a semitone step if one is available", "condition" : "if one is available", "consequence" : "Always choose a semitone step","action" : ""}, {"text" : "Use this table for reference while youre practicing", "condition" : "while youre practicing", "consequence" : "Use this table for reference","action" : ""}, {"text" : "The chord notes in brackets are OK but try not to use them unless you absolutely have to!", "condition" : "unless you absolutely have to", "consequence" : "The chord notes in brackets are OK but try not to use them","action" : ""}]}