{"text" : "English can be hard to learn. Like most languages, it has its rules you need to follow. From writing to speaking English, learn 11 grammar rules that are important to know.When it comes to English grammar rules, you can start with your voice. Every human language starts an active sentence with the subject or the doer. In English, the verb (whats being done) follows the subject. If there is an object (the receiver of the action), it comes after the verb. The formula looks like:Explore a few examples of this grammar rule in action. The subjects are in bold, the verbs are underlined and the objects are in italics.Shelby dried the cat.Mary walked the dog.The dog liked Mary.I did not like the dog.Sometimes you want to link two ideas with a second S+V+O combination. When you do, you need a coordinating conjunction. The addition of the coordinating conjunction creates a new layout for you to follow.Take this sentence for example: Delia found a cat, but it ran into the alley. Before but, the subject is Delia, the verb is found and the object is cat. After but, the subject is it, the verb is ran, and the object is alley.Coordinating conjunctions are easy to remember with an acronymic mnemonic device: FANBOYS. Each letter of the acronym stands for one coordinating conjunction: For, And, Nor, But, Or, Yet, So.Coordinating conjunctions are used when connecting two ideas as one in a single sentence, but dont forget the comma. You can see the use and placement of the comma in these examples.I do not walk Marys dog, nor do I wash him.Mary fed her dog, and I drank tea.Mary feeds and walks her dog every day, but the dog is still hyperactive.The serial, or Oxford, comma is a controversial rule of grammar. Some want to eliminate it altogether, while others just dont know how to use it. The serial comma is the last comma in a list, usually appearing before and. So, for example, you can see the serial comma comes after dog in the sentence.Pets R Us has lizards, dogs, and birds.Commas separate units in a list. In the example sentence, each unit only has one part, so its easy. Where people get confused is when the units are bigger, but the rule still applies. For example:Pets R Us has lizards and frogs, dogs and cats, and parakeets and macaws.Notice that the serial comma comes before and but not the last and in the sentence. The and that follows the comma is only there to discuss the two types of birds.When it comes to a list of grammar rules, you have to include the scariest of punctuation marks. It might look funny, but dont be afraid of the semicolon; its the easiest thing in the world to use! Say you want to join two ideas but cant figure out or cant be bothered to use a coordinating conjunction. The two ideas can be separate sentences, but you think that they are so closely connected; they really should be one. Use a semicolon.Marys dog is hyperactive; it wont stop barking or sit still.My heart is like a cup of Lapsang Souchong tea; its bitter and smoky.Mary has to walk her dog every day; it is the most hyperactive dog anyone has ever seen.Simple present is the tense you use for any habitual action. For example, the things you always do or do every Tuesday are described with the simple present, which just means you pick the basic form of any verb.I run to Shellys every other day.I walk Marys dog on Wednesday.Mary and I drink tea every Tuesday together.The present progressive tense is for anything that is happening right now. All of the progressive tenses are easy to spot because their verbs always end with -ing and get a helping verb. A helping verb is there so we know who and when the sentence is talking about. In the present progressive, the helping verbs are the present tense conjugations of to be.I am drinking Lapsang Souchong tea.The barking dogs outside are driving me crazy.Mary is playing with her hyperactive dog.When we talk about the past, we have to add an -ed to regular verbs to make the past tense form. Irregular verbs are tricky because they have their own sets of rules, but most of the time, you make it past tense by adding -ed.She walked the dog to the park.The dogs stopped barking two seconds ago, and I am feeling better.Mary played fetch with her hyperactive dog.The present perfect can be confusing for some, but it is one of the most important rules of grammar. For example, when people talk about things that have already happened but consider the time in which they occurred to be unfinished, they use the present perfect with a helping verb. The helping verb for the present perfect is the present tense conjugation of to have.I have drunk three cups of Lapsang Souchong tea today.Marys hyperactive dog has bitten me three times so far.Mary has walked her hyperactive poodle 100 times this week.Unfortunately, the only way to know the present perfect form of verbs is to remember them.When the action, as well as the time, is considered unfinished, the verb loads up on present perfect form helping verbs (to be and to have) and changes to the progressive form. When you use this form, it looks like these examples.Western countries have been waging wars in the Middle East for thousands of years.I have been drinking tea all day.Marys dog has been barking like crazy since it was born.When two things happen in the past, we have to mark which one happened first. The one that happened first changes to the past perfect form and gets the helping verb had.By the time I drank one cup of Lapsang Souchong, Marys dog had barked a million times.I had not yet eaten breakfast when Mary walked her dog.He could not pay for lunch because he had lost his wallet.Understanding and consistently following the basic English grammar rules will help you speak and write English correctly and with minimal hesitation. And its one of the key steps to becoming proficient with the English language. See more English grammar fun by checking out 10 examples of bad grammar.","rules" : [{"text" : "When it comes to English grammar rules, you can start with your voice", "condition" : "When it comes to English grammar rules", "consequence" : "you can start with your voice","action" : ""}, {"text" : "If there is an object (the receiver of the action), it comes after the verb", "condition" : "there is an object", "consequence" : "it comes after the verb","action" : ""}, {"text" : "When you do, you need a coordinating conjunction", "condition" : "When you do", "consequence" : "you need a coordinating conjunction","action" : ""}, {"text" : "The addition of the coordinating conjunction creates a new layout for you to follow", "condition" : "The addition of the coordinating conjunction", "consequence" : "creates a new layout for you to follow","action" : ""}, {"text" : "Coordinating conjunctions are used when connecting two ideas as one in a single sentence, but dont forget the comma", "condition" : "when connecting two ideas as one in a single sentence", "consequence" : "Coordinating conjunctions are used","action" : ""}, {"text" : "In the example sentence, each unit only has one part, so its easy", "condition" : "each unit only has one part", "consequence" : "so its easy","action" : ""}, {"text" : "Where people get confused is when the units are bigger, but the rule still applies", "condition" : "when the units are bigger", "consequence" : "people get confused","action" : ""}, {"text" : "When it comes to a list of grammar rules, you have to include the scariest of punctuation marks", "condition" : "When it comes to a list of grammar rules", "consequence" : "you have to include the scariest of punctuation marks","action" : ""}, {"text" : "All of the progressive tenses are easy to spot because their verbs always end with -ing and get a helping verb", "condition" : "because their verbs always end with -ing and get a helping verb", "consequence" : "All of the progressive tenses are easy to spot","action" : ""}, {"text" : "A helping verb is there so we know who and when the sentence is talking about", "condition" : "A helping verb is there", "consequence" : "so we know who and when the sentence is talking about","action" : ""}, {"text" : "In the present progressive, the helping verbs are the present tense conjugations of to be", "condition" : "In the present progressive", "consequence" : "the helping verbs are the present tense conjugations of to be","action" : ""}, {"text" : "When we talk about the past, we have to add an -ed to regular verbs to make the past tense form", "condition" : "When we talk about the past", "consequence" : "we have to add an -ed to regular verbs to make the past tense form","action" : ""}, {"text" : "Irregular verbs are tricky because they have their own sets of rules, but most of the time, you make it past tense by adding -ed", "condition" : "Irregular verbs are trickymost of the time", "consequence" : "because they have their own sets of rulesyou make it past tense by adding -ed","action" : ""}, {"text" : "For example, when people talk about things that have already happened but consider the time in which they occurred to be unfinished, they use the present perfect with a helping verb", "condition" : "when people talk about things that have already happened but consider the time in which they occurred to be unfinished", "consequence" : "they use the present perfect with a helping verb","action" : ""}, {"text" : "When the action, as well as the time, is considered unfinished, the verb loads up on present perfect form helping verbs (to be and to have) and changes to the progressive form", "condition" : "When the action, as well as the time, is considered unfinished", "consequence" : "the verb loads up on present perfect form helping verbs (to be and to have) and changes to the progressive form","action" : ""}, {"text" : "When you use this form, it looks like these examples", "condition" : "When you use this form", "consequence" : "it looks like these examples","action" : ""}, {"text" : "When two things happen in the past, we have to mark which one happened first", "condition" : "When two things happen in the past", "consequence" : "we have to mark which one happened first","action" : ""}]}