{"text" : "You must always show respect towards your opponents when playing in any type of sporting event. The people that you are playing against are not your enemies and should be treated like any other person. It is important to maintain your morals and not engage in any disrespectful actions like screaming at or humiliating an opponent, even when frustrated. Most sports assess some sort of penalty or foul for unsportsmanlike conduct during a game or match. As a part of showing respect for your opponent, it is courteous for players to shake hands and congratulate their opponents after every game. Referees should be shown respect at all times before, during, and after any sporting event. There is no reason any players or coaches should be disrespectful towards referees due to the fact that typically calls cannot be reversed after they are already made. Referees are trying to do their job just as much as the next person, and human error is a part of every sport, so there is no reason to get angry at a referee or an official for a call that might be controversial. If you imagine yourself in the scenario of a referee or umpire, it is difficult and stressful, which makes it hard to get every single call correct. It is better to just keep any thoughts about referees to yourself as sometimes it will simply do more harm to you and your team than good.In any sporting event, the coach should be seen as the boss of all the players. No worker would show disrespect to their boss and think that they would get away with it. The only difference with sports is instead of getting fired, the person would just get benched or removed from the team if they disrespect their coach. Disrespecting the coach could include actions like disobeying instructions, talking negatively about them, or substituting themselves into the game without permission. All these actions will make a coach frustrated and can lead to consequences. Respecting your coach is something that kids learn from a young age since coaches are usually older than the players and summon respect from them. For a team to function effectively, it is vital that all players follow the instructions of their coaches and show respect towards them at all times...It’s not a good idea to push yourself through pain or discomfort. Being an athlete requires you to have a long-term vision of your future-self. Getting the win is important, but your health and safety is always most important. Never sacrifice your wellbeing in sports if it means putting yourself or others in harm's way.Players should always show respect to their teammates. Teamwork is the most important thing to winning, and if teammates do not get along, then the team chemistry will be disrupted, making it harder to win. Showing respect to your teammates includes showing up everyday and working your hardest and doing everything you can in order to win a game. Everyone has the same goal, which is to win, and if a player disrupts that mentality it will cause a rift in the team’s chemistry.To be a team player, one must always aim to support their teammates. A team player will do anything that is necessary to help the team win. A team player is not necessarily the best person on the court or field. In fact, it could be the last person off the bench. However, even the last person is doing their job because it is for the good of the team. A team player does not care about what they want when it comes to games, but instead thinks about what the team needs and incorporates that into their style of play. Team players are what push entire teams over the top into success. On the best teams, all the players are team players and they all will put the team’s needs over their own.Any athlete is bound to make some sort of mistake during their athletic career or fail at a time when they wanted to succeed. When playing sports, players need to have a short term memory in order to succeed to the highest level. This means that when a mistake is made or a player fails, the best thing that they can do is figure out what they could have done better, learn from that mistake, and forget about it. The advice that a lot of coaches give is to forget about past mistakes so they don’t influence your decision making throughout the rest of the game.. Having a short term memory will make a player more confident and lead to more success in the future.Sports, as well as life, are made up of both wins and losses. The small victories are what truly builds up to the final product, leading to the bigger victories. For example, small victories may be each win that a team earns in a season, or each strikeout a pitcher can force. These small achievements can eventually lead to bigger accomplishments like a league championship. Whatever it is, small victories should be celebrated no matter how small they may be. Celebrating smaller victories can be used as confident boosters that could propel a team over the top and make them the best that they can be. The small victories that a team accomplishes may not be the things that everybody remembers, but they are sometimes the most vital part of a team’s overall success throughout a season or beyond.A person should always be pushing themselves to do the best work that they can do, both in sports and throughout life. There is no reason to only put half your effort into something you are trying to succeed at. Great things will happen if you work hard in every aspect of life, but especially in sports, when you try your hardest, good things will come. Athletes capable of playing sports professionally are not only the best athletes in the world, but they are also the hardest workers. They have the best work ethic and even if they feel that they are overmatched on a specific night, they don’t back down from the challenge. Effort is the only thing that a player can control so they should be pushing themselves to do better each and every day.The reason people begin playing sports is because they are a lot of fun to play, watch, and be a part of. Sports are amazing because they bring people of all different backgrounds together to work towards the same goal. As players get older, they usually lose the love and passion they have for a sport and focus more on winning. However, if a player is not genuinely having fun while playing a sport, it may not be the best use of their time. Professional athletes maintain the same love for their sports as they did in their youth, and continue to grow their passion as they improve their game and rise to higher levels. Associating fun with sports should be instilled in our youth to make sure that they do not get too wrapped up in winning or losing to prioritize anything else above having fun.At the completion of a sporting event or match, athletes should always keep etiquette in mind. No matter the result of the game, all players should leave with class. If a team wins, players should not showboat or try to embarrass the other team but instead congratulate and shake hands with the opponent. If a team were to lose, they should not be overly upset, show angry emotion, or try to create excuses for the loss. Instead, it is best to congratulate the winning team and move on. No matter the outcome of any game, players should continue to respect their teammates, coaches, opponents, and referees and should continue to show class during and especially after the game.","rules" : [{"text" : "You must always show respect towards your opponents when playing in any type of sporting event", "condition" : "when playing in any type of sporting event", "consequence" : "You must always show respect towards your opponents","action" : ""}, {"text" : "As a part of showing respect for your opponent, it is courteous for players to shake hands and congratulate their opponents after every game. ", "condition" : "As a part of showing respect for your opponent", "consequence" : "it is courteous for players to shake hands and congratulate their opponents after every game","action" : ""}, {"text" : "There is no reason any players or coaches should be disrespectful towards referees due to the fact that typically calls cannot be reversed after they are already made", "condition" : "due to the fact that typically calls cannot be reversed after they are already made", "consequence" : "There is no reason any players or coaches should be disrespectful towards referees","action" : ""}, {"text" : "Referees are trying to do their job just as much as the next person, and human error is a part of every sport, so there is no reason to get angry at a referee or an official for a call that might be controversial", "condition" : "Referees are trying to do their job just as much as the next person, and human error is a part of every sport", "consequence" : "so there is no reason to get angry at a referee or an official for a call that might be controversial","action" : ""}, {"text" : "If you imagine yourself in the scenario of a referee or umpire, it is difficult and stressful, which makes it hard to get every single call correct", "condition" : "If you imagine yourself in the scenario of a referee or umpire", "consequence" : "it is difficult and stressful, which makes it hard to get every single call correct","action" : ""}, {"text" : "It is better to just keep any thoughts about referees to yourself as sometimes it will simply do more harm to you and your team than good", "condition" : "as sometimes it will simply do more harm to you and your team than good", "consequence" : "It is better to just keep any thoughts about referees to yourself","action" : ""}, {"text" : "The only difference with sports is instead of getting fired, the person would just get benched or removed from the team if they disrespect their coach", "condition" : "if they disrespect their coach", "consequence" : "instead of getting fired, the person would just get benched or removed from the team","action" : ""}, {"text" : "All these actions will make a coach frustrated and can lead to consequences", "condition" : "All these actions", "consequence" : "will make a coach frustrated and can lead to consequences","action" : ""}, {"text" : "Never sacrifice your wellbeing in sports if it means putting yourself or others in harm's way", "condition" : "if it means putting yourself or others in harm's way", "consequence" : "Never sacrifice your wellbeing in sports","action" : ""}, {"text" : "Teamwork is the most important thing to winning, and if teammates do not get along, then the team chemistry will be disrupted, making it harder to win", "condition" : "if teammates do not get along", "consequence" : "then the team chemistry will be disrupted, making it harder to win","action" : ""}, {"text" : "Everyone has the same goal, which is to win, and if a player disrupts that mentality it will cause a rift in the team’s chemistry", "condition" : "if a player disrupts that mentality", "consequence" : "it will cause a rift in the team’s chemistry","action" : ""}, {"text" : "To be a team player, one must always aim to support their teammates", "condition" : "To be a team player", "consequence" : "one must always aim to support their teammates","action" : ""}, {"text" : "However, even the last person is doing their job because it is for the good of the team", "condition" : "because it is for the good of the team", "consequence" : "even the last person is doing their job","action" : ""}, {"text" : "When playing sports, players need to have a short term memory in order to succeed to the highest level", "condition" : "When playing sports", "consequence" : "players need to have a short term memory","action" : ""}, {"text" : "This means that when a mistake is made or a player fails, the best thing that they can do is figure out what they could have done better, learn from that mistake, and forget about it", "condition" : "when a mistake is made or a player fails", "consequence" : "the best thing that they can do is figure out what they could have done better, learn from that mistake, and forget about it","action" : ""}, {"text" : "Having a short term memory will make a player more confident and lead to more success in the future", "condition" : "Having a short term memory", "consequence" : "will make a player more confident and lead to more success in the future","action" : ""}, {"text" : "Effort is the only thing that a player can control so they should be pushing themselves to do better each and every day", "condition" : "Effort is the only thing that a player can control", "consequence" : "so they should be pushing themselves to do better each and every day","action" : ""}, {"text" : "The reason people begin playing sports is because they are a lot of fun to play, watch, and be a part of", "condition" : "because they are a lot of fun to play, watch, and be a part of", "consequence" : "The reason people begin playing sports","action" : ""}, {"text" : "Sports are amazing because they bring people of all different backgrounds together to work towards the same goal", "condition" : "Sports are amazing", "consequence" : "because they bring people of all different backgrounds together to work towards the same goal","action" : ""}, {"text" : "As players get older, they usually lose the love and passion they have for a sport and focus more on winning", "condition" : "As players get older", "consequence" : " they usually lose the love and passion they have for a sport and focus more on winning","action" : ""}, {"text" : "However, if a player is not genuinely having fun while playing a sport, it may not be the best use of their time", "condition" : "if a player is not genuinely having fun while playing a sport", "consequence" : "it may not be the best use of their time","action" : ""}, {"text" : "If a team wins, players should not showboat or try to embarrass the other team but instead congratulate and shake hands with the opponent", "condition" : "If a team wins", "consequence" : "players should not showboat or try to embarrass the other team but instead congratulate and shake hands with the opponent","action" : ""}, {"text" : "If a team were to lose, they should not be overly upset, show angry emotion, or try to create excuses for the loss", "condition" : "If a team were to lose", "consequence" : "they should not be overly upset, show angry emotion, or try to create excuses for the loss","action" : ""}, {"text" : "Instead, it is best to congratulate the winning team and move on", "condition" : "Instead", "consequence" : "it is best to congratulate the winning team and move on","action" : ""}]}